{
    "id": "lecture-1-1",
    "name": "Prednáška 1 - Úvod do robota ROSMASTER R2 a jeho komponentov",
    "description": [
        { "type": "title", "content": "Úvod" },
        { "type": "text", "content": "Vitajte na vzdialenom kurze robotiky s platformou Rosmaster R2. Tento kurz vám poskytne základné znalosti v oblasti robotiky kombináciou zaujímavých praktických skúseností so silnými teoretickými vedomosťami. Po úspešnom absolvovaní bude mať študent pevné základné znalosti v oblasti autonómnej mobility a bude schopný implementovať od najzákladnejších až po pokročilé funkcie na robotovi Rosmaster R2."},
        { "type": "text", "content": "Čo je Rosmaster R2? Je to v podstate diaľkovo ovládané vozidlo doplnené o ďalšie hardvérové a softvérové komponenty, ktoré ho menia na univerzálnou platformu pre robotiku. Predstavuje ideálny vzdelávací nástroj na učenie základov robotiky a ovládanie Robotického operačného systému (ROS) z toho dôvodu, že je navrhnutý tak, aby napodobňoval funkčnosť autonómnych vozidiel."},
        { "type": "text", "content": "Tento kurz je štruktúrovaný tak, aby vás postupne previedol od základných konceptov k pokročilým aplikáciám v robotike. Témy zahŕňajú: základné zapojenie a konfiguráciu Rosmaster R2, prácu so senzormi, implementáciu základných algoritmov pre navigáciu, využitie AI pre autonómne funkcie, počítačové videnie, hlboké učenie, autopilota a prípadne rozšírenia ako hlasové ovládanie."},
        { "type": "text", "content": "Tieto vlastnosti robota Rosmaster R2 sú výsledkom kombinácie výkonného hardvéru a inteligentných softvérových komponentov. Na úplné pochopenie fungovania tohto systému a naučenie sa jeho ovládania je nevyhnutné preskúmať dve základné oblasti: Hardvér (všetky fyzické komponenty, ako sú motory, senzory a procesory) a Softvér (inteligencia za hardvérom, ROS, spracovanie úloh, ako je navigácia, spracovanie senzorov, rozhodovanie a funkcie podporované umelou inteligenciou)."},
        { "type": "title", "content": "Hardvérové komponenty robota" },
        { "type": "subtitle", "content": "Jetson Orin NX 8GB" },
        { "type": "text", "content": "<a href='https://www.techpowerup.com/gpu-specs/jetson-orin-nx-8-gb.c4081' target='_blank'>NVIDIA Jetson Orin NX 8GB</a> je centrálny procesorový modul v Rosmaster R2, navrhnutý na zvládanie pokročilých úloh v oblasti AI a robotiky. Je to komponent, na ktorom je nainštalovaný systém ROS a kde prebieha všetko spracovanie."},
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/t_Jetson Orin NX 8GB /v1735049178/jetson_orin_nx_m3rwu2.jpg", "alt": "An image showcasing a Jetson Orin NX 8GB." },
        { "type": "text", "content": "Obsahuje 8GB LPDDR5 pamäte, ktorá umožňuje rýchly prístup k údajom a plynulý chod systému, potrebný na spracovanie senzorových dát, spúšťanie AI modelov a riadenie robota." },
        { "type": "text", "content": "Vďaka NVIDIA Ampere GPU a Arm Cortex-A78AE CPU zvláda Jetson Orin NX úlohy ako detekcia objektov, navigácia a rozhodovanie v reálnom čase." },
        { "type": "text", "content": "Jetson Orin NX 8GB funguje ako mozog Rosmastera R2 a poskytuje mu výpočtový výkon, ktorý mu umožňuje spúšťať zložité modely AI, spracovávať dáta zo senzorov v reálnom čase a spravovať navigačné a rozhodovacie úlohy." },
        { "type": "subtitle", "content": "ROS robot expansion board" },
        { "type": "text", "content": "Táto <a href='https://category.yahboom.net/products/ros-driver-board' target='_blank'>multifunkčná programovacia vývojová doska od Yahboom</a> je zároveň všestrannou riadiacou doskou pre roboty. Slúži ako ovládač ROS auta a zároveň ako vývojová doska s jadrom STM32. Táto doska je navrhnutá pre robotické systémy založené na systéme ROS a funguje ako rozhranie medzi robotickým hardvérom a operačným systémom ROS. Je postavená na mikroprocesore STM32, čo umožňuje pokročilé programovanie a riadenie hardvéru." },
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/v1735138079/61KN8cFPEXL._SL1500__jlleby.jpg", "alt": "An image showcasing a ROS robot expansion board." },
        { "type": "text", "content": "Účelom tejto dosky je integrovať riadenie, komunikáciu a správu napájania do jedného celku, čím sa zjednodušuje tvorba pokročilých robotických systémov" },
        { "type": "subtitle", "content": "USB HUB expansion board" },
        { "type": "text", "content": "Táto rozširujúca doska je <a href='https://category.yahboom.net/products/usb-hub' target='_blank'>vysokovýkonný USB 3.0 hub od spoločnosti Yahboom</a>, kompatibilný so širokou škálou zariadení vrátane Jetson Orin NX." },
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/v1735144186/Sdfb8c362c36d40aba3ccd3fdbeeca0d7H.jpg_640x640q90_nycq0u.webp", "alt": "An image showcasing a ROS robot expansion board." },
        { "type": "text", "content": "Má jeden vstupný USB port na pripojenie k hlavnej doske (v tomto prípade Jetson Orin NX) a štyri USB 3.0 výstupy, ktoré podporujú prenos dát až 500 MB/s. Táto doska podporuje tri režimy napájania – micro USB, DC5.5*2.5 a XH2.54 – s možnosťou vstupného napätia 9-24 V. Čip VL817 HUB zabezpečuje spoľahlivý prenos dát bez výpadkov spôsobených nedostatkom napájania. Táto univerzálna doska je široko použiteľná pre roboty, inteligentné autá a vývojové platformy a poskytuje robustný výkon pre náročné aplikácie." },
        { "type": "text", "content": "Hlavným účelom tejto dosky je rozšírenie konektivity. V systéme Rosmaster R2 umožňuje súčasné pripojenie viacerých periférií, ako sú kamery, LIDAR a externé úložiská." },
        { "type": "subtitle", "content": "Hĺbková kamera" },
        { "type": "text", "content": "Na Rosmaster R2 je nainštalovaná kamera Astra Pro Plus, pokročilé zariadenie na snímanie 3D obrazu zo <a href='https://category.yahboom.net/products/usb-hub' target='_blank'> série Astra od Orbbecu</a>. Táto kamera je súčasťou prvej rodiny 3D kamier využívajúcich technológiu štruktúrovaného svetla – metódu, ktorá meria hĺbku a vytvára 3D modely prostredia projekciou svetelného vzoru (ako sú mriežky alebo body) na povrch a analýzou jeho deformácií." },
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/v1735144408/O1CN01nGcRg523QYJ0BxkIF__375997250_hwhnhv.webp", "alt": "An image showcasing a Hĺbková kamera." },
        { "type": "text", "content": "Astra Pro Plus sa používa najmä na:" },
        { "type": "bullet", "item": "Depth sensing ", "description": "(meranie hĺbky) – umožňuje robotovi vnímať okolie v 3D." },
        { "type": "bullet", "item": "Obstacle Detection ", "description": "(detekciu prekážok) – identifikáciu a vyhýbanie sa prekážkam počas navigácie." },
        { "type": "bullet", "item": "3D Mapping and Reconstruction ", "description": "(3D mapovanie a rekonštrukciu) – tvorbu podrobných modelov prostredia pre autonómnu prevádzku." },
        { "type": "bullet", "item": "Human-Interaction Tasks ", "description": " (úlohy interakcie s ľuďmi) – podporuje rozpoznávanie gest a sledovanie tváre v interaktívnych situáciách." },
        { "type": "text", "content": "Podrobné vlastnosti a funkcie kamery budú podrobnejšie rozobraté v ďalšej časti kurzu." },
        { "type": "subtitle", "content": "A1 Lidar" },
        { "type": "text", "content": "<a href='https://www.ibm.com/topics/lidar' target='_blank'> LIDAR</a>, alebo Light Detection and Ranging, je technológia, ktorá využíva laserové lúče na meranie vzdialeností k objektom. Funguje na princípe vysielania laserových impulzov, ktoré sa odrazia od okolitých objektov a vrátia sa späť k senzoru." },
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/v1735145387/rplidar-a1-1_opfjug.jpg", "alt": "An image showcasing a A1 Lidar." },
        { "type": "text", "content": "<a href='https://www.slamtec.com/en/Lidar/A1/' target='_blank'> RPLIDAR A1</a>, ktorý sa nachádza v Rosmaster R2, je 360° senzor schopný skenovať okolie rotáciou v smere hodinových ručičiek. Tento senzor používa Slamtec OPTMAG technológiu, ktorá nahrádza bežné klzné krúžky bezdrôtovou energiou a optickou komunikáciou. Táto technológia eliminuje mechanické opotrebenie, čím výrazne predlžuje životnosť a zlepšuje spoľahlivosť v porovnaní s tradičnými LIDAR senzormi." },
        { "type": "text", "content": "Špecializuje sa na presné 2D mapovanie a detekciu prekážok na veľké vzdialenosti. Poskytuje presné merania vzdialeností vo všetkých smeroch, čo ho robí ideálnym na úlohy, ako je mapovanie veľkých oblastí, identifikácia vzdialených prekážok a efektívne plánovanie trás v otvorených prostrediach." },
        { "type": "text", "content": "Podrobné vlastnosti a funkcie LiDARa budú podrobnejšie rozobraté v ďalšej časti kurzu." },
        { "type": "subtitle", "content": "OLED displej" },
        { "type": "text", "content": "Zobrazuje základné systémové informácie, ako sú stav batérie alebo IP adresa siete." },
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/t_bebra/v1735145683/5_fa4af9ae-66e6-4358-9e9e-d375843fb33f_1024x_t8gs6k.jpg", "alt": "An image showcasing a OLED displej." },
        { "type": "subtitle", "content": "7-inch LCD displej" },
        { "type": "text", "content": "Zobrazuje používateľské rozhranie systému Ubuntu bežiaceho na ROSMASTER R2, čo umožňuje priamu interakciu so systémom pri programovaní a ladení." },
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/v1735145840/LB-00015_7_inch_LCD_HDMI_Touch_Screen_Display_TFT_for_Raspberry_Pi_3_1_tansan.jpg", "alt": "An image showcasing a 7-inch LCD displej." },
        { "type": "subtitle", "content": "Wi-Fi Antény" },
        { "type": "text", "content": "Umožňujú diaľkové ovládanie robota prostredníctvom mobilnej aplikácie alebo počítača, pričom zaisťujú stabilnú komunikáciu a konektivitu." },
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/v1735146143/8986a0b81cab69081d2afdbf0f9d7e92_jbzlgi.jpg", "alt": "An image showcasing a Wi-Fi Antény." },
        { "type": "subtitle", "content": "9-osový senzor orientácie" },
        { "type": "text", "content": "9-osový senzor v ROSMASTER R2 zahŕňa 3-osový gyroskop na meranie uhlovej rýchlosti, 3-osový akcelerometer na detekciu lineárneho pohybu a náklonu, ako aj 3-osový magnetometer na určenie smeru podľa magnetického poľa Zeme. Tieto komponenty spoluponúkajú presné údaje na sledovanie orientácie a pohybu." },
        { "type": "text", "content": "Podrobné vlastnosti a funkcie budú podrobnejšie rozobraté v ďalšej časti kurzu." },
        { "type": "subtitle", "content": "Reproduktor" },
        { "type": "text", "content": "Zabezpečuje zvukový výstup pre systémové upozornenia, notifikácie alebo vlastné zvukové prehrávanie." },
        { "type": "subtitle", "content": "Led Pásik" },
        { "type": "text", "content": "Programovateľný LED pásik s možnosťou prispôsobiteľného osvetlenia, ktoré môže indikovať stav systému alebo aktivitu." },
        { "type": "subtitle", "content": "Motor M2 a Motor M4" },
        { "type": "text", "content": "Na Rosmaster R2 sú nainštalované dva motory M2 a M4 na ovládanie zadných kolies." },
        { "type": "subtitle", "content": "Batéria" },
        { "type": "text", "content": "Zabezpečuje napájanie Rosmaster R2 a podporuje ovládač Jetson Orin NX. Umožňuje spoľahlivú prevádzku a zahŕňa funkcie ako výstrahy pri nízkom napätí a efektívne riadenie energie." },
        { "type": "subtitle", "content": "Modul na Hlasovú Interakciu" },
        { "type": "text", "content": "Slúži ako zvukový vstup robota, ktorý umožňuje hlasové ovládanie." },
        { "type": "title", "content": "Softvérové komponenty" },
        { "type": "text", "content": "ROSMASTER R2 používa operačný systém <a href='https://ubuntu.com/robotics' target='_blank'> Ubuntu</a>, ktorý je založený na Linuxe, a má predinštalovaný <a href='https://www.ros.org/' target='_blank'> ROS</a> (Robot Operating System)." },
        { "type": "text", "content": "Prečo Ubuntu? Lebo je to široko používaný operačný systém v robotike vďaka svojej stabilite, otvorenému kódu a podpore pre ROS, čo ho robí ideálnym na vývoj a prevádzku robotických aplikácií." },
        { "type": "text", "content": "Prečo ROS? Lebo je to open-source framework na programovanie a vývoj robotov. Poskytuje knižnice a nástroje na implementáciu navigácie, integrácie senzorov a riadenia pohybu." },
        { "type": "text", "content": "ROS slúži primárne na riadenie komunikácie medzi hardvérom a softvérom robota, čo umožňuje funkcie ako vnímanie, rozhodovanie a vykonávanie pohybu." },
        { "type": "text", "content": "Podrobnosti o Ubuntu a ROS, vrátane ich úloh a výhod, budú podrobnejšie preberané neskôr v kurze. Rovnako sa neskôr budeme venovať aj ďalšiemu softvéru, ktorý je súčasťou Rosmaster R2."},
        { "type": "title", "content": "Príprava na cvičenie" },
        { "type": "text", "content": "Na cvičenie si budete musieť stiahnuť túto aplikáciu a počas cvičenia budeme pracovať s diaľkovým ovládaním robota."},
        { "type": "image", "src": "https://res.cloudinary.com/devzsrl7h/image/upload/v1735146911/16250477241055-min_uudl5e.png", "alt": "An image showcasing a QR code." }
    ]
} 